{
  "2025-2-27": [
    [
      "2025-02-27 01:14PM",
      "Graduate chairs express concerns over admissions cuts in letter to SAS admin"
    ],
    [
      "2025-02-27 03:24PM",
      ""
    ],
    [
      "2025-02-27 05:21PM",
      "15 hours agoSame sport, different game: The nuances of indoor vs. outdoor track and fieldThe differences between the two disciplines offer key insights into a student-athlete’s preparation."
    ]
  ],
  "2025-2-28": [
    [
      "2025-02-28 03:12AM",
      "6 hours agoAnna Brandt breaks all-time goal record in a dominant win over Temple for Penn women's lacrosseBrandt scored her 149th goal to become Penn's all-time leading goal scorer."
    ],
    [
      "2025-02-28 03:10PM",
      "18 hours agoAnna Brandt breaks all-time goal record in a dominant win over Temple for Penn women's lacrosseBrandt scored her 149th goal to become Penn's all-time leading goal scorer."
    ]
  ],
  "2025-3-1": [
    [
      "2025-03-01 03:11AM",
      "3 hours agoPenn women’s basketball dominates Dartmouth, nears Ivy League Tournament berthSenior guard Stina Almqvist and freshman forward Katie Collins hit their sixth double-doubles of the season."
    ],
    [
      "2025-03-01 03:09PM",
      "15 hours agoPenn women’s basketball dominates Dartmouth, nears Ivy League Tournament berthSenior guard Stina Almqvist and freshman forward Katie Collins hit their sixth double-doubles of the season."
    ]
  ],
  "2025-3-2": [
    [
      "2025-03-02 03:11AM",
      "2 hours agoDominant Harvard defense puts Penn women’s basketball's hopes for Ivy Madness in jeopardyThe 62-44 loss has the Quakers tied with Brown heading into Penn’s final game of the season."
    ],
    [
      "2025-03-02 03:09PM",
      "14 hours agoDominant Harvard defense puts Penn women’s basketball's hopes for Ivy Madness in jeopardyThe 62-44 loss has the Quakers tied with Brown heading into Penn’s final game of the season."
    ]
  ],
  "2025-3-3": [
    [
      "2025-03-03 03:14AM",
      "1 hour agoMatt Fallon notches nation-leading time in the 200-yard breaststroke at Ivy League ChampionshipsFallon now holds the title of fastest 200 breaststroker in the NCAA this season."
    ],
    [
      "2025-03-03 03:10PM",
      "5 hours agoPenn baseball's senior pitcher Will Tobin has one last rodeoThe Tennessee native is looking for an Ivy League Championship for his last roundup on the mound."
    ]
  ],
  "2025-3-4": [
    [
      "2025-03-04 03:12AM",
      "17 hours agoPenn baseball's senior pitcher Will Tobin has one last rodeoThe Tennessee native is looking for an Ivy League Championship for his last roundup on the mound."
    ],
    [
      "2025-03-04 03:10PM",
      "03/03/25 9:14amPenn baseball's senior pitcher Will Tobin has one last rodeoThe Tennessee native is looking for an Ivy League Championship for his last roundup on the mound."
    ]
  ],
  "2025-3-5": [
    [
      "2025-03-05 03:13AM",
      "4 hours agoPenn men’s basketball’s two New York games offer glimpses of season at-largeThe team’s performance against Columbia was a vision of what the season could have been."
    ],
    [
      "2025-03-05 03:11PM",
      "16 hours agoLee | Penn men’s basketball’s two New York games offer glimpses of season at-largeThe team’s performance against Columbia was a vision of what the season could have been."
    ]
  ],
  "2025-3-6": [
    [
      "2025-03-06 03:13AM",
      "3 hours agoPenn gymnastics earns perfect record against Ivy League competitorsThe team continues to ramp up as they head towards the GEC Championship."
    ],
    [
      "2025-03-06 03:10PM",
      "2 hours agoAgent Zero: Freshman guard AJ Levine is the one to watchThe freshman is a \"feisty\" defensive player whose competitive mindset has led him to greatness."
    ]
  ],
  "2025-3-7": [
    [
      "2025-03-07 03:12AM",
      "44 minutes agoPenn wrestling is eyeing accolades at the inaugural Ivy League ChampionshipsThe Red and Blue were among only three schools that drew No. 1 seeds in the inaugural championships."
    ],
    [
      "2025-03-07 03:10PM",
      "12 hours agoPenn wrestling is eyeing accolades at the inaugural Ivy League ChampionshipsThe Red and Blue were among only three schools that drew No. 1 seeds in the inaugural championships."
    ]
  ],
  "2025-3-8": [
    [
      "2025-03-08 03:09AM",
      "11 hours agoDistance Dominance: Anna Moehn and Sydney Bergstrom qualify for NCAA Championships for Penn women’s swimming and divingAt least one Quaker distance freestyler has qualified NCAAs for three seasons-straight."
    ],
    [
      "2025-03-08 03:07PM",
      "23 hours agoDistance Dominance: Anna Moehn and Sydney Bergstrom qualify for NCAA Championships for Penn women’s swimming and divingAt least one Quaker distance freestyler has qualified NCAAs for three seasons-straight."
    ]
  ],
  "2025-3-9": [
    [
      "2025-03-09 04:10AM",
      "8 hours agoPenn loses to Princeton for the 13th consecutive time in final game of the seasonFor the first time since 1905, the all-time series record between Penn and Princeton is tied, standing at 126-126."
    ],
    [
      "2025-03-09 04:08PM",
      "20 hours agoPenn loses to Princeton for the 13th consecutive time in final game of the seasonFor the first time since 1905, the all-time series record between Penn and Princeton is tied, standing at 126-126."
    ]
  ],
  "2025-3-10": [
    [
      "2025-03-10 04:11AM",
      "7 hours agoPenn men’s squash becomes back-to-back national championsWith a 5-2 victory over Yale, the team completes a perfect 20-0 season."
    ],
    [
      "2025-03-10 04:10PM",
      "3 hours agoSteve Donahue out as Penn men’s basketball coach after nine seasonsThe Quakers finished seventh in the Ivy League for the second straight season."
    ]
  ],
  "2025-3-11": [
    [
      "2025-03-11 04:13AM",
      "16 hours agoSteve Donahue out as Penn men’s basketball coach after nine seasonsThe Quakers finished seventh in the Ivy League for the second straight season."
    ],
    [
      "2025-03-11 04:10PM",
      "03/10/25 12:09pmSteve Donahue out as Penn men’s basketball coach after nine seasonsThe Quakers finished seventh in the Ivy League for the second straight season."
    ]
  ],
  "2025-3-12": [
    [
      "2025-03-12 04:13AM",
      "03/10/25 12:09pmSteve Donahue out as Penn men’s basketball coach after nine seasonsThe Quakers finished seventh in the Ivy League for the second straight season."
    ],
    [
      "2025-03-12 04:10PM",
      "11 hours agoCollins wins Rookie of the Year, Almqvist named to first team in Ivy women’s basketball awardsSophomore guard Mataya Gayle also earned All-Ivy honors."
    ]
  ],
  "2025-3-13": [
    [
      "2025-03-13 04:14AM",
      "23 hours agoCollins wins Rookie of the Year, Almqvist named to first team in Ivy women’s basketball awardsSophomore guard Mataya Gayle also earned All-Ivy honors."
    ],
    [
      "2025-03-13 04:10PM",
      "03/12/25 4:58amCollins wins Rookie of the Year, Almqvist named to first team in Ivy women’s basketball awardsSophomore guard Mataya Gayle also earned All-Ivy honors."
    ]
  ],
  "2025-3-14": [
    [
      "2025-03-14 04:12AM",
      "03/12/25 4:58amCollins wins Rookie of the Year, Almqvist named to first team in Ivy women’s basketball awardsSophomore guard Mataya Gayle also earned All-Ivy honors."
    ]
  ],
  "2025-3-15": [
    [
      "2025-03-15 04:11AM",
      "5 hours agoStrong defense not enough as Penn women’s basketball falls to Columbia 60-54 in Ivy Madness semifinalsThe Quakers were eliminated from Ivy League title contention with the defeat."
    ],
    [
      "2025-03-15 04:09PM",
      "17 hours agoStrong defense not enough as Penn women’s basketball falls to Columbia 60-54 in Ivy Madness semifinalsThe Quakers were eliminated from Ivy League title contention with the defeat."
    ]
  ],
  "2025-3-16": [
    [
      "2025-03-16 04:11AM",
      "03/14/25 10:29pmStrong defense not enough as Penn women’s basketball falls to Columbia 60-54 in Ivy Madness semifinalsThe Quakers were eliminated from Ivy League title contention with the defeat."
    ]
  ],
  "2025-3-17": [
    [
      "2025-03-17 04:14AM",
      "2 hours agoPenn gymnastics ends regular season with victory and program record at two different meetsSenior gymnast Skyelar Kerico’s Yurchenko 1.5 earned her first place in program history in vault."
    ],
    [
      "2025-03-17 04:10PM",
      "14 hours agoPenn gymnastics ends regular season with victory and program record at two different meetsSenior gymnast Skyelar Kerico’s Yurchenko 1.5 earned her first place in program history in vault."
    ]
  ],
  "2025-3-18": [
    [
      "2025-03-18 04:13AM",
      "3 hours ago‘A school that can’t make up its mind’: Former governor Ed Rendell slams Penn's firing of Steve DonahueThe 1965 College graduate spoke with The Daily Pennsylvanian in an exclusive interview."
    ],
    [
      "2025-03-18 04:09PM",
      "3 hours agoThree individual titles fuel Penn wrestling's second place finish at Ivy League tournamentThe Quakers displayed resilience and grit en route to eight podium finishes."
    ]
  ],
  "2025-3-19": [
    [
      "2025-03-19 04:13AM",
      "5 hours agoPenn men’s lacrosse drops Phila. rivalry game 11-10 against St. Joe’sThe Quakers never led as they lost to the Hawks for the second straight year."
    ],
    [
      "2025-03-19 04:11PM",
      "7 hours agoTeam Impact has a special impact on Penn men's lacrossePenn men’s lacrosse is one of the many Penn teams that have matched with children through Team IMPACT."
    ]
  ],
  "2025-3-20": [
    [
      "2025-03-20 04:13AM",
      "3 hours agoHere’s what to know about former Penn swimmer Lia ThomasThe Daily Pennsylvanian took a look back at Thomas’ journey to Penn, her time representing Penn Athletics, and her impact after graduation."
    ],
    [
      "2025-03-20 04:11PM",
      "15 hours agoHere’s what to know about former Penn swimmer Lia ThomasThe Daily Pennsylvanian took a look back at Thomas’ journey to Penn, her time representing Penn Athletics, and her impact after graduation."
    ]
  ],
  "2025-3-21": [
    [
      "2025-03-21 04:13AM",
      "11 hours agoFrom 'circus child' to self-assured star: Penn gymnast Marissa Lassiter eyes NCAA RegionalsThe versatile junior gymnast credits her mindset and supportive team for her success."
    ],
    [
      "2025-03-21 04:10PM",
      "23 hours agoFrom 'circus child' to self-assured star: Penn gymnast Marissa Lassiter eyes NCAA RegionalsThe versatile junior gymnast credits her mindset and supportive team for her success."
    ]
  ],
  "2025-3-22": [
    [
      "2025-03-22 04:11AM",
      "03/20/25 4:13pmFrom 'circus child' to self-assured star: Penn gymnast Marissa Lassiter eyes NCAA RegionalsThe versatile junior gymnast credits her mindset and supportive team for her success."
    ]
  ],
  "2025-3-23": [
    [
      "2025-03-23 04:11AM",
      "4 hours agoPenn gymnastics wins GEC Championships for the fourth consecutive yearWith world-class performances from a variety of disciplines, the Quakers once again showcased their championship pedigree."
    ],
    [
      "2025-03-23 04:10PM",
      "16 hours agoPenn gymnastics wins GEC Championships for the fourth consecutive yearWith world-class performances from a variety of disciplines, the Quakers once again showcased their championship pedigree."
    ]
  ],
  "2025-3-24": [
    [
      "2025-03-24 04:14AM",
      "3 hours agoPenn wrestling's CJ Composto earns All-American honors at NCAA championshipsThe attendees included 1968 Wharton graduate and President Donald Trump."
    ],
    [
      "2025-03-24 04:10PM",
      "6 hours agoSam Brown of Penn men’s basketball to enter transfer portalBrown led the Ivy League in points per game during conference play."
    ]
  ],
  "2025-3-25": [
    [
      "2025-03-25 04:13AM",
      "5 hours agoTwo Penn gymnasts qualify to NCAA Regionals at Penn StateJunior Skyelar Kerico and freshman Mimi Fletcher mark Penn's two participants"
    ],
    [
      "2025-03-25 04:10PM",
      "4 hours agoPenn men's and women's fencing both finish 8th at NCAA fencing championshipsSeniors Bryce Louse and Sabrina Cho end their Penn careers with fighting performances."
    ]
  ]
}